# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [31, 30,  31, 37,  24, 61]
  - [33, 63,  42, 56,  32, 111]
  - [44, 114,  48, 172,  80, 112]



# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, RepS_Block, [48, 3, 2, 1]],           # 0   c   k   s  padding=1      /2

    [-1, 1, DER_Block, [48, 1, 2]],   # MobileOne [out_channels, num_blocks, num_conv_branches, use_se, num_se, inference_mode]   /4

    [-1, 1, MP, []],

    [-1, 1, DER_Block, [128, 1, 2]],

    [-1, 1, MP, []],

    [-1, 1, DER_Block, [256, 1, 2]],

    [-1, 1, MP, []],

    [ -1, 1, DER_Block, [512, 1, 2]],
    [-1, 1, MP, []],

  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]],

   [-1, 1, GSConv, [128, 1, 1]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, GSConv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, VoVGSCSP, [256]],


   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, GSConv, [128, 1, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, CA, [128]],
   [-2, 1, CCVA, [128]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [256, 1, 1]],

   [-1, 1, VoVGSCSP, [128]],


   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, CA, [64]],
   [-2, 1, CCVA, [64]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [128, 1, 1]],

   [-1, 1, MP, []],
   [-1, 1, GSConv, [128, 1, 1]],
   [-3, 1, GSConv, [128, 1, 1]],
   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, -3, 14], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, CA, [256]],
   [-2, 1, CCVA, [256]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [512, 1, 1]],

   [-1, 1, VoVGSCSP, [256]],


   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, CA, [128]],
   [-2, 1, CCVA, [128]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [256, 1, 1]],

   [-1, 1, MP, []],
   [-1, 1, GSConv, [256, 1, 1]],
   [-3, 1, GSConv, [256, 1, 1]],
   [-1, 1, GSConv, [256, 3, 2]],
   [[-1, -3, 9], 1, Concat, [1]],

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, CA, [512]],
   [-2, 1, CCVA, [512]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [1024, 1, 1]],

   [-1, 1, VoVGSCSP, [512]],


   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, CA, [256]],
   [-2, 1, CCVA, [256]],
   [[-1, -2], 1, ADD, []],
   [-1, 1, Conv, [512, 1, 1]],

   [29, 1, RepConv, [256, 3, 1]],
   [45, 1, RepConv, [512, 3, 1]],
   [61, 1, RepConv, [1024, 3, 1]],

   [[62,63,64], 1, IDetect, [nc, anchors]],
  ]
